import React from 'react';
import './Classes.css'
const Safty = () => {
  console.log('Condetions');
  return (
    <article className='container'>
      <div className='about'style={{width:"40%",height:"500px",overflowY:"scroll"}}>
        <h1>الأمان</h1>
        <br/>
        <p></p>
        <br/>
        <p>نقصد بهذا البند من بنود الخدمة و هو الأمان حيث لن يتم مشاركة معلوماتك مع اي فرد او منظمة في حال التزامك بشروط الخدمة </p>
        <p>
بوصولك إلى الموقع الإلكتروني أو استخدام الخدمات تقر بأنك قد قرأت هذه الشروط وفهمتها وتتعهد بالالتزام بها وأي تغيير أو تحديث يطرأ عليها من وقت لآخر وفق قرار Travel الوحيد</p>
        <br/>
        <p>
عند الدخول إلى أو التصفح أو استخدام الموقع الالكتروني أو الخدمة، إنك توافق على الالتزام بهذه الشروط. بالإضافة إلى ذلك، عند استخدام جزء من الخدمة، إنك توافق على الامتثال لأية إرشادات منشورة قابلة للموقع لمثل هذه الخدمة والتي قد تتغير أو يتم تحديثها من وقت لآخر وفقًا لتقدير Travel الخاص. إنك تتفهم وتوافق على أنك المسؤول الوحيد عن مراجعة هذه الشروط من وقت لآخر. في حالة اعتراضك على أي بند أو شرط من هذه الشروط، أو أي مبدأ توجيهي، أو أية تغييرات لاحقة عليه أو تصبح غير راضٍ عن Travel أو الخدمة بأي شكل من الأشكال ، يكون خيارك الوحيد هو التوقف فوراً عن استخدام موقع Travel. من الممكن تحديث هذه الشروط من قِبل Travel في أي وقت وفقًا لتقديرها الخاص. قد ترسل لك Travel إشعارات بالتغييرات على الموقع الإلكتروني أو الشروط وفقًا للقسم xxi (I) من هذا المستند. قد توفر Travel ترجمة النسخة الإنجليزية للشروط إلى لغات أخرى. إنك تتفهم وتوافق على أن أية ترجمة للشروط إلى لغات أخرى هي فقط ملائمة لك وأن إصدار الشروط باللغة الإنجليزية يحكم شروط علاقتك مع Travel. علاوة على ذلك، في حال وجود أي تناقض بين النسخة الإنجليزية من الشروط وأية ترجمة، فإن النسخة الإنجليزية من الشروط تكون المعمول بها</p> 
       <br/>
       <p>إنك تدرك أن Travelلا تتحكم وليست مسؤولة عن الإعلانات، ومعلومات الدليل، والقوائم /المعلومات التجارية، والرسائل بين المستخدمين بما في ذلك على سبيل المثال لا الحصر، رسائل البريد الإلكتروني المرسلة من خارج نطاق Travel أو غيرها من وسائل الاتصالات الإلكترونية سواء من خلال الموقع الإلكتروني أو موقع الطرف الثالث الآخر (المحدد أدناه) أو العروض أو التعليقات أو منشورات المستخدمين أو الملفات أو الصور أو الرسوم أو الفيديو أو الأصوات أو قوائم الأعمال/المعلومات ومعلومات الدليل أو أية مواد أخرى متوفرة عبر الموقع الإلكتروني والخدمة ("المحتوى"). كما انه عند استخدامك الموقع الالكتروني والخدمة، قد تتعرض لمحتوى مسيء أو غير لائق أو غير دقيق، او مضلل، أو غير مقبول أوموضوع إعتراض. أنك تقر وتوافق على أنك مسؤول عن وعليك أن تقيّم وتتحمل جميع المخاطر المرتبطة باستخدام أي محتوى. كما لا يجوز لك الاعتماد على المحتوى المذكور، وأنه لن تكون Travel تحت أي ظرف من الظروف مسؤولة بأي شكل من الأشكال عن المحتوى أو عن أي خسارة أو ضرر من أي نوع يحدث نتيجة للتصفح، استخدام أو قراءة أي محتوى مدون أو بريد إلكتروني أو غير ذلك متاح عبر الخدمة.
إنك تقر وتوافق على أن Travel تسمح بعرض مثل هذه السلع والخدمات وتقديمها على الموقع الالكتروني الذي يتوافق مع الشروط المنصوص عليها في هذا المستند. ومع ذلك، لا تقوم Travel بإجراء فحص مسبق للمحتوى أو الموافقة عليه. انما يكون ل Travel الحق، وفقًا لتقديرها الخاص والمطلق، في رفض أو حذف أو نقل أي محتوى يكون متوفرا" عبر الخدمة لانتهاك هذه الشروط وقد علمت Travel عن هكذا انتهاك أو لأي سبب آخر أو بدون سبب على الإطلاق. علاوة على ذلك، قد يحتوي الموقع الالكتروني والمحتوى المتاح عبر الموقع الإلكتروني على روابط لمواقع الكترونية أخرى تابعة لأطراف ثالثة، قد تخضع لشروط المواقع الالكترونية الخاصة بهذه الاطراف الثالثة (المواقع الالكترونية للأطراف الثالثة) والتي هي غير مرتبطة تمامًا بـ Bigstore، وقد تخضع لشروط واحكام الموقع الالكتروني الخاص بهذه الأطراف الثالثة والسياسات الأخرى عند معاينتك الرابط التابع للأطراف الثالثة. لا تقوم Travel بأي تمثيل أو ضمان فيما يتعلق بدقة أو صحة المعلومات الموجودة في أي موقع من مواقع الأطراف الثالثة وربطك بأية مواقع أخرى يكون على مسؤوليتك الخاصة تمامًا، وتبرئ Travel ذمتها عن أي مسؤولية بهذا الخصوص</p>
       </div>
    </article>
  )
}
export default Safty;